In [3]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import import_ipynb
from Student_info import country_Student
from Student_info import student_info
from collections import Counter

In [4]:
student_purchases = pd.read_csv('dataSets/365_database/365_student_purchases.csv')
student_purchases
student_purchases['purchase_type'].unique()

array(['Annual', 'Monthly', 'Quarterly'], dtype=object)

In [5]:
missing_country_df = student_info[student_info.isnull().any(axis=1)]
missing_country = missing_country_df['student_id'].tolist()
missing_country

[261725,
 262665,
 272144,
 278827,
 282654,
 282914,
 283704,
 283791,
 284550,
 284790,
 286959,
 290648,
 293967]

In [6]:
df = student_purchases.copy()

df_cleaned = df[~df['student_id'].isin(missing_country)]
student_purchases_cleaned = df_cleaned.reset_index(drop=True)
(student_purchases_cleaned)

      purchase_id  student_id purchase_type date_purchased
0           15781      258800        Annual     2022-01-01
1           15786      258803        Annual     2022-01-01
2           15808      258862        Annual     2022-01-01
3           15809      258865        Annual     2022-01-01
4           15811      258878        Annual     2022-01-01
...           ...         ...           ...            ...
3035        23148      278055       Monthly     2022-10-20
3036        23150      270103        Annual     2022-10-20
3037        23151      270824       Monthly     2022-10-20
3038        23152      295497       Monthly     2022-10-20
3039        23153      295506        Annual     2022-10-20

[3040 rows x 4 columns]

In [7]:
country = []
i = 0
n = len(student_purchases_cleaned)-1

while (i<=n):
    x=student_purchases_cleaned['student_id'].loc[i]
    y=country_Student[x]
    country.append(y)
    i=i+1

In [8]:
print(len(country))
df_country = pd.DataFrame(country,columns = ['country'])
df_country

3040

     country
0         CA
1         US
2         NL
3         CA
4         CA
...      ...
3035      ZW
3036      GB
3037      US
3038      NL
3039      GB

[3040 rows x 1 columns]

In [9]:
frames = [student_purchases_cleaned, df_country]

student_purchases_by_country = pd.concat(frames,axis = 1)

print(student_purchases_by_country.info())
# print(student_purchases_by_country.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3040 entries, 0 to 3039
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   purchase_id     3040 non-null   int64
 1   student_id      3040 non-null   int64
 2   purchase_type   3040 non-null   object
 3   date_purchased  3040 non-null   object
 4   country         3040 non-null   object
dtypes: int64(2), object(3)
memory usage: 118.9+ KB
None

In [10]:
student_purchase_annual =student_purchases_by_country[student_purchases_by_country['purchase_type']=='Annual'].reset_index(drop=True)
student_purchase_quarterly =student_purchases_by_country[student_purchases_by_country['purchase_type']=='Quarterly'].reset_index(drop=True)
student_purchase_monthly =student_purchases_by_country[student_purchases_by_country['purchase_type']=='Monthly'].reset_index(drop=True)

In [11]:

annual_purchase = student_purchase_annual['date_purchased'].tolist()
annual = Counter(annual_purchase)

purchase_annual = pd.DataFrame.from_dict(annual,orient = 'index').reset_index()
# purchase_annual.to_excel('annual.xlsx')


quarterly_purchase = student_purchase_quarterly['date_purchased'].tolist()
quarterly = Counter(quarterly_purchase)

purchase_quarterly = pd.DataFrame.from_dict(quarterly,orient = 'index').reset_index()
# purchase_quarterly.to_excel('quarterly.xlsx')


monthly_purchase = student_purchase_monthly['date_purchased'].tolist()
monthly = Counter(monthly_purchase)

purchase_monthly = pd.DataFrame.from_dict(monthly,orient = 'index').reset_index()
# purchase_monthly.to_excel('monthly.xlsx')

From the above dataframe we can track the number and type of subscriptions purchased across time.

<mark>'date_purchased'</mark> will be extracted from these dataframes, exported as Excel files and then, visualized (line graphs? in Tableau Public.

#### Update:

I think it will be easier to visualize if I export the necessary data to excel in the form of a dictionary.

And hence, I will use the Counter() function from the collection module to create a dictionary from a list of values.

Export the said dictionary to Excel and try visualizing.

In [12]:
student_purchase_quarterly['date_purchased'].value_counts()

2022-08-04    2
2022-10-12    2
2022-07-08    2
2022-05-20    2
2022-09-20    2
2022-01-12    1
2022-07-10    1
2022-07-13    1
2022-07-16    1
2022-07-25    1
2022-07-26    1
2022-08-02    1
2022-08-16    1
2022-08-08    1
2022-06-30    1
2022-08-20    1
2022-08-29    1
2022-08-31    1
2022-09-25    1
2022-09-30    1
2022-10-04    1
2022-10-05    1
2022-07-05    1
2022-06-22    1
2022-01-13    1
2022-04-06    1
2022-01-25    1
2022-01-31    1
2022-02-02    1
2022-02-06    1
2022-02-09    1
2022-02-20    1
2022-03-04    1
2022-03-10    1
2022-04-10    1
2022-06-18    1
2022-04-12    1
2022-04-13    1
2022-04-19    1
2022-04-20    1
2022-04-25    1
2022-05-02    1
2022-05-11    1
2022-05-18    1
2022-10-13    1
Name: date_purchased, dtype: int64